//-----------------------------------------------------------------------
// Лабораторная работа #4 (часть 2) по дисциплине "Программирование на языке высокого уровня. C++"
// Проект итогового приложения.
// 
// Преподаватель: Иванова Т.В.
// Студент      : Емельянова М.А.
// 
// Laboratory work #4 (part 2) in the discipline "Programming in a high-level language. C++"
// Teacher      : Ivanova T.V.
// Student      : Emelyanova M.A.
//-----------------------------------------------------------------------
// Итоговое приложение: QT + VS
//-----------------------------------------------------------------------

#include <QApplication>
#include "dqt_psf.h"

int main(int argc, char* argv[])
{
	// Создаем приложение
	QApplication app(argc, argv);
	// Создаем диалоговое окно
	DQtPSF dialog;
	// Запускаем дилоговое окно
	dialog.show();
	// Запускаем приложение
	return app.exec();
}
